app/controllers/admin/employees_controller.rb

  def create
    @admin_employee = Admin::Employee.new(admin_employee_params)

    respond_to do |format|
      if @admin_employee.save
---
INSERT INTO "admin_employees" ("last_name", "first_name", "organization", "phone", "email", "id_number", "salt", "crypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_admin_employee
      @employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 3]]