app/controllers/employees_controller.rb

SELECT "participants".* FROM "participants"
---
  def index
    @employees = Employee.all
    @participants = Participant.all

INSERT INTO "employees" ("last_name", "first_name", "organization", "phone", "id_number", "email", "salt", "crypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
      @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save