app/controllers/organizations_controller.rb

INSERT INTO "organizations" ("name", "adress", "zip_code", "city", "parent_organization", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @organization = Organization.new(organization_params)

    respond_to do |format|
      if @organization.save

DELETE FROM "organizations" WHERE "organizations"."id" = ?  [["id", 1]]
---
  def destroy
    @organization.destroy