app/controllers/participants_controller.rb

  def index
    @participants = Participant.all
---
SELECT "participants".* FROM "participants"

  def show
   @participant = Participant.find(params[:id])
---
SELECT  "participants".* FROM "participants" WHERE "participants"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @participant = Participant.new(participant_params)

    respond_to do |format|
      if @participant.save
---
INSERT INTO "participants" ("last_name", "first_name", "place_of_birth", "id_number", "adress", "city", "email", "affiliation_process", "entry_solution", "output_solution", "entry_process", "expected_process", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_participant
      @participant = Participant.find(params[:id])
---
SELECT  "participants".* FROM "participants" WHERE "participants"."id" = ? LIMIT 1  [["id", 3]]