app/controllers/user_sessions_controller.rb

  def new
      @employee = Employee.new
      @employees = Employee.all
      @participants = Participant.all
---
SELECT "participants".* FROM "participants"